# Menata ulang kolom pada data frame

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

Mempersiapkan Data Frame

In [2]:
n_rows=5
n_cols=5
cols=tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10, size=(n_rows, n_cols)),
                 columns=cols)
df

   A  B  C  D  E
0  2  8  3  9  6
1  6  8  9  5  8
2  8  9  2  6  2
3  7  7  4  8  5
4  4  6  9  8  1

# Menata Ulang penempatan kolom pada data frame

menempatkan kolom dengan urutan D,C,A,E,B

penataan ulang kolom ini sifatnya tidak in place, artinya ketika kita melakukan proses ini maka proses ini akan mengahsilkan data frame baru dengan urutan kolom yang seperti ini

In [3]:
df[['D','C','A','E','B']]

   D  C  A  E  B
0  9  3  2  6  8
1  5  9  6  8  8
2  6  2  8  2  9
3  8  4  7  5  7
4  8  9  4  1  6

data frame dengan urutan kolom yang sama dengan di atas

In [4]:
df

   A  B  C  D  E
0  2  8  3  9  6
1  6  8  9  5  8
2  8  9  2  6  2
3  7  7  4  8  5
4  4  6  9  8  1

jika ingin penataan kolom nya bisa di terapkan pada variable df manka langkahnya sebagai berikut:

In [5]:
df=df[['D','C','A','E','B']]
df

   D  C  A  E  B
0  9  3  2  6  8
1  5  9  6  8  8
2  6  2  8  2  9
3  8  4  7  5  7
4  8  9  4  1  6